<?php
$progressLevels = [
    'SQLインジェクション' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'x', 'レベル4' => 'x'],
    'XSS' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'x', 'レベル4' => 'x'],
    'CSRF' => ['レベル1' => 'o','レベル2' => 'x'],
    'OSコマンドインジェクション' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o']
];

// '認証の不備' => ['レベル1' => 'o', 'レベル2' => 'o'],
//     '情報の露呈' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x'],
//     'XXE' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o'],
//     'アクセス制御の不備' => ['レベル1' => 'o', 'レベル2' => 'o'],
//     'デシリアライゼーション' => ['レベル1' => 'o', 'レベル2' => 'o'],
//     'コンポーネント' => ['レベル1' => 'o', 'レベル2' => 'x', 'レベル3' => 'o', 'レベル4' => 'x'],
//     'ロギング' => ['レベル1' => 'o'],
//     'Text-text' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'x', 'レベル4' => 'x'],