<?php
$progressLevels = [
    'インジェクション' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'x', 'レベル4' => 'x'],
    '認証の不備' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x'],
    '情報の露呈' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x'],
    'XXE' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x'],
    'アクセス制御の不備' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x'],
    'XSS' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x'],
    'デシリアライゼーション' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x'],
    'コンポーネント' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x'],
    'ロギング' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x'],
    'Text-text' => ['レベル1' => 'o', 'レベル2' => 'o', 'レベル3' => 'o', 'レベル4' => 'x']
];
?>